app/controllers/planes_controller.rb

INSERT INTO "lanes" ("row", "column", "plane_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["row", 3], ["column", 2], ["plane_id", 1], ["created_at", "2017-05-01 14:03:59.047981"], ["updated_at", "2017-05-01 14:03:59.047981"]]
INSERT INTO "planes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2017-04-30 11:47:00.435205"], ["updated_at", "2017-04-30 11:47:00.435205"]]
---
  def create
    @plane = Plane.new(plane_params)
    if @plane.save

SELECT "lanes".* FROM "lanes" WHERE "lanes"."plane_id" = ?  ORDER BY "lanes"."id" ASC  [["plane_id", 1]]
SELECT "planes".* FROM "planes"
---
  def load_planes
    @planes = Plane.all

SELECT  "lanes".* FROM "lanes" WHERE "lanes"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "planes".* FROM "planes" WHERE "planes"."id" = ? LIMIT 1  [["id", 1]]
---
  def load_plane
    @plane = Plane.find_by(id: params[:id] || params[:plane_id])